Tekla Open API Reference for Tekla Structures 2025
IntList.LastIndexOf Method (Int32)
 Searches for the last occurence of the integer in the list.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int LastIndexOf(
	int value
)
Public Function LastIndexOf (
	value As Integer
) As Integer
Parameters
value
Type: System.Int32
The integer to locate.
Return Value
Type: Int32
The last index of the integer if found, otherwise -1.
See Also
Reference
IntList Class
LastIndexOf Overload
Tekla.Structures.Drawing Namespace